---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyNoReferences
source: html/94c67dde-27c6-681f-f8da-19d7914b684a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyNoReferences Property

Elements can't be copied because they will lose their References.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyNoReferences { get; }
```